In [1]:
%load_ext sql

In [28]:
%sql mysql+pymysql://root:easwari@localhost

## GENERATE ALPHABET SEQUENCE FROM [A TO F] USING RECURSIVE CTE

In [30]:
%%sql
select ascii('A');

 * mysql+pymysql://root:***@localhost
   postgresql://postgres:***@localhost:5432/
1 rows affected.

[(65,)]

In [58]:
%%sql
select char(ascii('A'));

 * mysql+pymysql://root:***@localhost
   postgresql://postgres:***@localhost:5432/
1 rows affected.

[(b'A',)]

In [50]:
%%sql
with recursive alphabet_sequence as
(
select 'A' as "letter"
union all
select CHAR(ASCII(letter)+1) as "letter"
from alphabet_sequence
where letter < 'F'
)
select * from alphabet_sequence;

 * mysql+pymysql://root:***@localhost
   postgresql://postgres:***@localhost:5432/
6 rows affected.

[('A',), ('B',), ('C',), ('D',), ('E',), ('F',)]

## -----------------------------------------------------------------------------------------------------

In [3]:
%sql postgresql://postgres:easwari@localhost:5432/window_functions

## markdown

In [4]:
%%sql
with recursive cte as
(
    select 1 as "c1"

    union all

    select c1 + 1 
    from  cte
    where c1 < 20

)
select * from cte;

 * postgresql://postgres:***@localhost:5432/window_functions
20 rows affected.

[(1,),
 (2,),
 (3,),
 (4,),
 (5,),
 (6,),
 (7,),
 (8,),
 (9,),
 (10,),
 (11,),
 (12,),
 (13,),
 (14,),
 (15,),
 (16,),
 (17,),
 (18,),
 (19,),
 (20,)]

In [5]:
%%sql
select * from orders1;

 * postgresql://postgres:***@localhost:5432/window_functions
16 rows affected.

[(1, datetime.date(2024, 7, 1)),
 (2, datetime.date(2024, 7, 2)),
 (3, datetime.date(2024, 7, 3)),
 (5, datetime.date(2024, 7, 5)),
 (6, datetime.date(2024, 7, 6)),
 (7, datetime.date(2024, 7, 7)),
 (9, datetime.date(2024, 7, 9)),
 (10, datetime.date(2024, 7, 10)),
 (11, datetime.date(2024, 7, 11)),
 (13, datetime.date(2024, 7, 13)),
 (14, datetime.date(2024, 7, 14)),
 (15, datetime.date(2024, 7, 15)),
 (16, datetime.date(2024, 7, 16)),
 (18, datetime.date(2024, 7, 18)),
 (19, datetime.date(2024, 7, 19)),
 (20, datetime.date(2024, 7, 20))]

In [6]:
%%sql
with recursive cte as
(
    select 1 as "c1"

    union all

    select c1 + 1 
    from  cte
    where c1 < 20

)
select cte.*, o.* 
from cte left join orders1 as o
on cte.c1 = o.order_id;

 * postgresql://postgres:***@localhost:5432/window_functions
20 rows affected.

[(1, 1, datetime.date(2024, 7, 1)),
 (2, 2, datetime.date(2024, 7, 2)),
 (3, 3, datetime.date(2024, 7, 3)),
 (5, 5, datetime.date(2024, 7, 5)),
 (6, 6, datetime.date(2024, 7, 6)),
 (7, 7, datetime.date(2024, 7, 7)),
 (9, 9, datetime.date(2024, 7, 9)),
 (10, 10, datetime.date(2024, 7, 10)),
 (11, 11, datetime.date(2024, 7, 11)),
 (13, 13, datetime.date(2024, 7, 13)),
 (14, 14, datetime.date(2024, 7, 14)),
 (15, 15, datetime.date(2024, 7, 15)),
 (16, 16, datetime.date(2024, 7, 16)),
 (18, 18, datetime.date(2024, 7, 18)),
 (19, 19, datetime.date(2024, 7, 19)),
 (20, 20, datetime.date(2024, 7, 20)),
 (17, None, None),
 (12, None, None),
 (8, None, None),
 (4, None, None)]

In [7]:
%%sql
with recursive cte as
(
    select 1 as "c1"

    union all

    select c1 + 1 
    from  cte
    where c1 < 20

)
select cte.*, o.* 
from cte left join orders1 as o
on cte.c1 = o.order_id
where o.order_id is null;

 * postgresql://postgres:***@localhost:5432/window_functions
4 rows affected.

[(17, None, None), (12, None, None), (8, None, None), (4, None, None)]

In [8]:
%%sql
with recursive cte as
(
    select 1 as "c1"

    union all

    select c1 + 1 
    from  cte
    where c1 < 20

)
select cte.c1 as "order_id"
from cte left join orders1 as o
on cte.c1 = o.order_id
where o.order_id is null
order by 1;

 * postgresql://postgres:***@localhost:5432/window_functions
4 rows affected.

[(4,), (8,), (12,), (17,)]

## method-2

In [16]:
%%sql
with cte as
(
select generate_series(min(order_id), max(order_id)) as "order_id"
from orders1
)
select *
from orders1 as "o" right join cte
on o.order_id = cte.order_id;

 * postgresql://postgres:***@localhost:5432/window_functions
20 rows affected.

[(1, datetime.date(2024, 7, 1), 1),
 (2, datetime.date(2024, 7, 2), 2),
 (3, datetime.date(2024, 7, 3), 3),
 (None, None, 4),
 (5, datetime.date(2024, 7, 5), 5),
 (6, datetime.date(2024, 7, 6), 6),
 (7, datetime.date(2024, 7, 7), 7),
 (None, None, 8),
 (9, datetime.date(2024, 7, 9), 9),
 (10, datetime.date(2024, 7, 10), 10),
 (11, datetime.date(2024, 7, 11), 11),
 (None, None, 12),
 (13, datetime.date(2024, 7, 13), 13),
 (14, datetime.date(2024, 7, 14), 14),
 (15, datetime.date(2024, 7, 15), 15),
 (16, datetime.date(2024, 7, 16), 16),
 (None, None, 17),
 (18, datetime.date(2024, 7, 18), 18),
 (19, datetime.date(2024, 7, 19), 19),
 (20, datetime.date(2024, 7, 20), 20)]

In [18]:
%%sql
with cte as
(
select generate_series(min(order_id), max(order_id)) as "order_id"
from orders1
)
select cte.order_id
from orders1 as "o" right join cte
on o.order_id = cte.order_id
where o.order_id is null;

 * postgresql://postgres:***@localhost:5432/window_functions
4 rows affected.

[(4,), (8,), (12,), (17,)]

## ---------------------------------------------------------------------------------------------------------------